Revit 2027 API
ParameterTypeId.FabricationPartLiningArea Property
 "Lining Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartLiningArea { get; }
Public Shared ReadOnly Property FabricationPartLiningArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartLiningArea {
	ForgeTypeId^ get ();
}
static member FabricationPartLiningArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace